      *STUDIYNG COBOL*
       IDENTIFICATION DIVISION.
      *EXCLUSÃO DE INFORMAÇÕES DOCUMENTAIS
       PROGRAM-ID. cobol.
       ENVIRONMENT DIVISION.
      *DESCREVE O COMPUTADOR ONDE O PROGRAMA ESTA SENDO ESCRITO
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WS-NOME         PIC X(10).
      *ARQUIVOS DE ENTRADAS E SAÍDAS, VÁRIAVEIS E CONSTANTES
       PROCEDURE DIVISION.
      *CONTÉM O CÓDIGO QUE IRÁ MANIPULAR OS DADOS E INCLUIR O ALGORITMO
      *DO PROGRAMA
           DISPLAY "DIGITE O NOME"
           ACCEPT WS-NOME
           DISPLAY "O NOME DIGITADO " WS-NOME
           STOP RUN.

       
        
